In [ ]:
import pandas as pd

In [ ]:
df = pd.read_csv("data.csv")

In [12]:
df.head()

,id,date,first_name,last_name,email,gender,ip_address,country,price_paid,tax
0,1,03/28/2021,Marylin,Alders,malders0@shop-pro.jp,Male,160.119.8.119,Canada,$5.36,NaN
1,2,03/19/2021,Hinda,Harridge,hharridge1@gnu.org,Female,210.51.172.132,Canada,$8.32,NaN
2,3,03/17/2021,Erl,Kilminster,ekilminster2@etsy.com,Male,213.8.101.145,United States,$3.73,20.0
3,4,03/19/2021,Grata,Brantl,gbrantl3@umn.edu,Female,5.140.237.101,United States,$3.70,20.0
4,5,03/24/2021,Kanya,Beasant,kbeasant4@jigsy.com,Male,106.252.162.233,Morocco,$9.24,20.0

In [ ]:
df.shape

In [ ]:
df.columns

In [ ]:
df.index

In [ ]:
df.dtypes

In [ ]:
df.columns.tolist()

In [ ]:
list(df.columns)

In [15]:
df.set_index("email", inplace=True)

In [16]:
df.index

Index(['malders0@shop-pro.jp', 'hharridge1@gnu.org', 'ekilminster2@etsy.com',
       'gbrantl3@umn.edu', 'kbeasant4@jigsy.com', 'tbraybrooke5@umn.edu',
       'akencott6@phoca.cz', 'cfeasley7@ed.gov', 'wheersema8@tumblr.com',
       'ggookes9@amazon.co.uk',
       ...
       'sthorburnri@prnewswire.com', 'ecrushrj@berkeley.edu',
       'mguilloneaurk@about.me', 'osnellerl@nhs.uk',
       'cbruntjenrm@reference.com', 'derrigorn@elpais.com',
       'arastallro@toplist.cz', 'bstickelsrp@cloudflare.com',
       'ptesoerq@rakuten.co.jp', 'rpringuerrr@house.gov'],
      dtype='object', name='email', length=1000)

In [17]:
df.describe()

                id    tax
count  1000.000000  654.0
mean    500.500000   20.0
std     288.819436    0.0
min       1.000000   20.0
25%     250.750000   20.0
50%     500.500000   20.0
75%     750.250000   20.0
max    1000.000000   20.0